# StructuralTopReleaseFx Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralTopReleaseFx Property
ParameterTypeId Class See Also
---
"Top Fx"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralTopReleaseFx { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralTopReleaseFx As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralTopReleaseFx {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace